ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p551x_gpio_ctrl_regs.xml
	<register id="GPALOCK" width="32" page="1" offset="0x3c" internal="0" description="GPIO A Lock Configuration Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPACR" width="32" page="1" offset="0x3e" internal="0" description="GPIO A Lock Commit Register (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPBCTRL" width="32" page="1" offset="0x40" internal="0" description="GPIO B Qualification Sampling Period Control (GPIO32 to 63)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO32 to GPIO39" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO40 to GPIO47" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO48 to GPIO55" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO56 to GPIO63" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
